from telebot.types import InlineKeyboardMarkup, InlineKeyboardButton, ReplyKeyboardMarkup, KeyboardButton


def about_school_menu(message, bot, update_last_interaction):
    chat_id = message.chat.id
    markups = ReplyKeyboardMarkup(resize_keyboard=True)
    bot.send_message(chat_id, """
👩‍🎓 Вітаємо у Hello Space! 🚀

Наш простір – це не просто школа. Це місце, де ви зможете вдосконалювати свої навички, знаходити нові знайомства та відкривати англійську мову з нового боку. Тут завжди легко та затишно, і ми робимо все можливе, щоб кожен відчував себе комфортно.

🌍 Англійська для нас – це більше ніж мова, це шлях до відкриття нових горизонтів, досягнення мрій та створення свого майбутнього. Ми пропонуємо не просто уроки, а цілісне занурення у світ англійської, де кожен знайде щось особливе для себе.
""")
    button_learning = KeyboardButton("💬 Популярні запитання")
    button_why = KeyboardButton("❓ Чому ми?") 
    button_main_menu = KeyboardButton("🏠 Головне меню")
    markups.add(button_learning, button_why)
    markups.add(button_main_menu)
    bot.send_message(chat_id, "Що ще Вам розповісти?👇", reply_markup=markups)
    update_last_interaction(message)
    
def why_we(message, bot, update_last_interaction):
    chat_id = message.chat.id
    bot.send_message(chat_id, """
🔹 Індивідуальний підхід
Ми пропонуємо курси, створені з урахуванням потреб і рівня знань кожного учня. Це гарантує ефективне навчання та швидкий прогрес.

🔹 Досвідчені викладачі
Наші викладачі – професіонали з великим досвідом у викладанні англійської мови. Вони створять сприятливу атмосферу, де навчання стає захоплюючим!

🔹 Гнучкий графік
Обирайте найзручніший час для занять – ми пропонуємо курси, що підходять під ваш розпорядок дня.

🔹 Інноваційні методи навчання
Ми використовуємо сучасні методики, що забезпечують розвиток усіх навичок – від читання до вимови.

🔹 Доступність
Ми пропонуємо доступні ціни на курси та можливість розбити оплату на частини. Вивчення англійської стало ще зручнішим!

🔹 Онлайн-ресурси
Отримуйте доступ до додаткових матеріалів, таких як відеоуроки, тести та інтерактивні вправи, які допоможуть вам досягти успіху.

🔹 Система підтримки
Наша команда завжди готова допомогти вам із будь-якими питаннями щодо навчання або процесу запису. Ми поруч на кожному кроці вашого шляху!
""")
    update_last_interaction(message)
    
def popular_question(message, bot, update_last_interaction):
    chat_id = message.chat.id
    bot.send_message(chat_id, """
❓ Які формати занять ви пропонуєте? Онлайн або офлайн?
Ми пропонуємо як 🖥️ онлайн, так і 🏫 офлайн формати навчання, щоб задовольнити різні потреби учнів.

❓ Які рівні володіння англійською мовою пропонуються на курсах?
Ми маємо курси для всіх рівнів: від 📘 початкового до 📕 просунутого.

❓ Як організовані групи?
Наші групи зазвичай складаються з 5-7 учасників, що гарантує 📚 ефективну комунікацію та 👩‍🏫 індивідуальний підхід.

❓ Як часто проводяться заняття?
Заняття проводяться 2 рази на тиждень 📅, але це може варіюватися в залежності від обраного курсу.

❓ Які можливості практики мовлення надаються на курсах?
Ми пропонуємо багато можливостей для 🗣️ практики мовлення: рольові ігри, дискусії, інтерактивні завдання та навіть спілкування з носіями мови.

❓ Чи потрібно мати попередні знання англійської для запису?
Наші курси відкриті для всіх 🏁! Ми пропонуємо 📊 тестування рівня перед початком навчання, щоб допомогти вам знайти найкращий курс.

❓ Які методи навчання використовуються?
Ми використовуємо 📖 комунікативний метод, інтерактивні завдання та автентичні матеріали для максимального занурення у мову.

❓ Які часові обмеження для запису на курси?
Ми приймаємо заявки цілий рік ⏳, але радимо записуватися заздалегідь, оскільки місця можуть бути обмежені.
""")
    bot.send_message(chat_id, """Не знайшли потрібну відповіді? Із радістю відповімо на всі Ваші запитання🥰 - @HelloSpace_english""")
    update_last_interaction(message)